![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 9.2 Filtering out Missing Data

First we import numpy and pandas libraries

In [1]:
import numpy as np
import pandas as pd

Here we creat a series that contains missing values:

In [2]:
ser1 = pd.Series([23,54, np.nan, None, 34, 87])
ser1

0    23.0
1    54.0
2     NaN
3     NaN
4    34.0
5    87.0
dtype: float64

To return a copy of the series without missing values we use the function **dropna()**:

In [3]:
ser1.dropna()

0    23.0
1    54.0
4    34.0
5    87.0
dtype: float64

We can also use boolean mask to create a mirror of the series without mising values using the function **notnull()**:

In [4]:
ser1[ser1.notnull()]

0    23.0
1    54.0
4    34.0
5    87.0
dtype: float64

Notice that the original series has not been changed:

In [5]:
ser1

0    23.0
1    54.0
2     NaN
3     NaN
4    34.0
5    87.0
dtype: float64

To make the changes permenant, we use the argument **inplace = True**:

In [6]:
ser1.dropna(inplace = True)

In [7]:
ser1

0    23.0
1    54.0
4    34.0
5    87.0
dtype: float64

In dataframe, to delete missing values, by default the entire row with missing value is deleted:

In [8]:
dt1 = pd.DataFrame([[1,None,3, 4,5], [6,None, 8,9, 10], [11, 12,13,14,15]])
dt1

    0     1   2   3   4
0   1   NaN   3   4   5
1   6   NaN   8   9  10
2  11  12.0  13  14  15

In [9]:
dt1.dropna()

    0     1   2   3   4
2  11  12.0  13  14  15

To delete the entire column that has missing value we use the argument **axis = 1**:

In [10]:
dt1.dropna(axis =1)

    0   2   3   4
0   1   3   4   5
1   6   8   9  10
2  11  13  14  15

In [11]:
dt2 = pd.DataFrame([[6,None, 8,9, 10],[None,None,None, None,None],
                    [11,12,13,14,15], [16,17,18,19,20]])
dt2

      0     1     2     3     4
0   6.0   NaN   8.0   9.0  10.0
1   NaN   NaN   NaN   NaN   NaN
2  11.0  12.0  13.0  14.0  15.0
3  16.0  17.0  18.0  19.0  20.0

We can instruct pandas to delete only rows or columns that are all missing, using argument **how = all**:

In [12]:
dt2.dropna(how = 'all')

      0     1     2     3     4
0   6.0   NaN   8.0   9.0  10.0
2  11.0  12.0  13.0  14.0  15.0
3  16.0  17.0  18.0  19.0  20.0

Consdier now this dataframe:

In [13]:
dt3 = pd.DataFrame([[6,None, np.nan,9, 10],[1,None,2, 3,4],
                    [11, None,13,14,15], [16,np.nan,18,19,20]])
dt3

    0   1     2   3   4
0   6 NaN   NaN   9  10
1   1 NaN   2.0   3   4
2  11 NaN  13.0  14  15
3  16 NaN  18.0  19  20

To delete columns that are all missing we add the argument **axis = 1**:

In [14]:
dt3.dropna(axis = 1, how = 'all')

    0     2   3   4
0   6   NaN   9  10
1   1   2.0   3   4
2  11  13.0  14  15
3  16  18.0  19  20

We can also instruct pandas to keep rows with certain number of values using the argument **thresh**:

In [15]:
dt4 = pd.DataFrame([[6,None, np.nan,9, 10],[1,2,None, np.nan,np.nan],
                    [11, None,13,14,15], [np.nan,16,18,19,20]])
dt4

      0     1     2     3     4
0   6.0   NaN   NaN   9.0  10.0
1   1.0   2.0   NaN   NaN   NaN
2  11.0   NaN  13.0  14.0  15.0
3   NaN  16.0  18.0  19.0  20.0

Here we instruct pandas to keep rows with at least three valid values:

In [16]:
dt4.dropna(thresh = 3)

      0     1     2     3     4
0   6.0   NaN   NaN   9.0  10.0
2  11.0   NaN  13.0  14.0  15.0
3   NaN  16.0  18.0  19.0  20.0

***

<h1 align="center">Thank You</h1> 

***